controllers/EventController.php

SELECT * FROM `event` WHERE `user_id`=3
---
    public function actionIndex() {
        $searchModel = new EventSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
                    'events' => Event::find()->where(['user_id' => Yii::$app->user->identity->memberIds])->all(),
                    'searchModel' => $searchModel,
                    'dataProvider' => $dataProvider,
        ]);