controllers/UserController.php

SELECT * FROM `profile` WHERE `user_id`=1
---
    public function actionProfile($id) {
        $user = $this->findModel($id);
        $model = $user->profile;
        $image = $model->image;
        if ($model->load(Yii::$app->request->post())) {