views/event/_form.php

SELECT * FROM `user` WHERE (parent_id = 1) OR (id = 1)
---

    <?php //echo $form->field($model, 'date')->textInput() ?>

    <?= $form->field($model, 'shared_with')->listBox( ArrayHelper::map(Yii::$app->user->identity->others, 'id', 'fullname'), ['multiple' => true] ) ?>