models/User.php

    public static function findIdentity($id) {
        //return isset(self::$users[$id]) ? new static(self::$users[$id]) : null;
        return null !== static::findOne($id) ? static::findOne($id) : null;
---
SELECT * FROM `user` WHERE `id`=1

    public static function findByIdentity($identity) {
        return static::findOne(['identity' => $identity]);
---
SELECT * FROM `user` WHERE `identity`='amal@livingdreams.lk'

    public function getFullName() {
        return $this->profile ? $this->profile->first_name . ' ' . $this->profile->last_name : '';
---
SELECT * FROM `profile` WHERE `user_id`=1

    public function findFamily($withParent = false) {
        $parent_id = $this->parent_id == 0 ? $this->id : $this->parent_id;
        $result = User::find()->where('parent_id = :parent_id',[':parent_id' => $parent_id]);
---
SELECT * FROM `user` WHERE parent_id = 1